
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |          13 |          0 |
## Affected resources by action

|  Action  | Resources                                                                                   |
|:--------:|:--------------------------------------------------------------------------------------------|
|    🟢    | `aws_iam_role_policy_attachment.registry-client["terraform-aws-guardduty-configuration"]`   |
|    🟢    | `module.registry-client-roles["terraform-aws-guardduty-configuration"].aws_iam_role.github` |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                                            |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                                   |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                                              |
|    🟡    | `module.mail_twindb_com.aws_autoscaling_group.postfix`                                      |
|    🟡    | `module.mail_twindb_com.aws_iam_policy.required`                                            |
|    🟡    | `module.mail_twindb_com.aws_launch_template.postfix`                                        |
|    🟡    | `module.terraform-aws-github-backup.aws_autoscaling_group.main`                             |
|    🟡    | `module.terraform-aws-github-backup.aws_launch_template.github-backup`                      |
|    🟡    | `module.vpn.aws_autoscaling_group.openvpn`                                                  |
|    🟡    | `module.vpn.aws_launch_template.openvpn`                                                    |
|    🟡    | `module.vpn.module.instance_profile.aws_iam_policy.profile`                                 |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website`                 |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`                   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.registry-client["terraform-aws-guardduty-configuration"] will be created
  + resource "aws_iam_role_policy_attachment" "registry-client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/registry-client20240303235455581600000001"
      + role       = "ih-tf-terraform-aws-guardduty-configuration-github"
    }

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "13" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ latest_version                       = 13 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (17 unchanged attributes hidden)

      + metadata_options {
          + http_endpoint = "enabled"
          + http_tokens   = "required"
        }

        # (4 unchanged blocks hidden)
    }

  # module.mail_twindb_com.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881",
            ]
        }
    }

  # module.mail_twindb_com.aws_autoscaling_group.postfix will be updated in-place
  ~ resource "aws_autoscaling_group" "postfix" {
        id                               = "postfix-20240326221552532900000008-5Qy881"
        name                             = "postfix-20240326221552532900000008-5Qy881"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "19" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.mail_twindb_com.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-2024032622160941250000000a"
        name             = "terraform-2024032622160941250000000a"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:f25015af-49b5-468c-88d7-6f9798874455:autoScalingGroupName/postfix-20240326221552532900000008-5Qy881"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.mail_twindb_com.aws_launch_template.postfix will be updated in-place
  ~ resource "aws_launch_template" "postfix" {
        id                                   = "lt-0e5d85805b1236e19"
      ~ image_id                             = "ami-0d413c682033e11fd" -> "ami-0c64a34bf821b0cd1"
      ~ latest_version                       = 19 -> (known after apply)
        name                                 = "postfix-20240326221552532900000008"
        tags                                 = {
            "created_by_module" = "infrahouse/postfix/aws"
        }
        # (16 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.registry-client-roles["terraform-aws-guardduty-configuration"].aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-guardduty-configuration:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo terraform-aws-guardduty-configuration"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-terraform-aws-guardduty-configuration-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.terraform-aws-github-backup.aws_autoscaling_group.main will be updated in-place
  ~ resource "aws_autoscaling_group" "main" {
        id                               = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        name                             = "infrahouse-github-backup2024100900462755050000000420241009004628273000000006"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "10" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.terraform-aws-github-backup.aws_launch_template.github-backup will be updated in-place
  ~ resource "aws_launch_template" "github-backup" {
        id                                   = "lt-05453df9000ac85e1"
      ~ image_id                             = "ami-0d413c682033e11fd" -> "ami-0c64a34bf821b0cd1"
      ~ latest_version                       = 10 -> (known after apply)
        name                                 = "infrahouse-github-backup20241009004627550500000004"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.vpn.data.aws_iam_policy_document.instance_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "instance_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sts:GetCallerIdentity",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:DescribeInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:ModifyInstanceAttribute",
            ]
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "openvpn-2024070518392010580000001e-nRBgZQ",
                ]
              + variable = "ec2:ResourceTag/aws:autoscaling:groupName"
            }
        }
    }

  # module.vpn.aws_autoscaling_group.openvpn will be updated in-place
  ~ resource "aws_autoscaling_group" "openvpn" {
        id                               = "openvpn-2024070518392010580000001e-nRBgZQ"
        name                             = "openvpn-2024070518392010580000001e-nRBgZQ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "11" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (9 unchanged blocks hidden)
    }

  # module.vpn.aws_launch_template.openvpn will be updated in-place
  ~ resource "aws_launch_template" "openvpn" {
        id                                   = "lt-0f7a032c61f3f5094"
      ~ image_id                             = "ami-0d413c682033e11fd" -> "ami-0c64a34bf821b0cd1"
      ~ latest_version                       = 11 -> (known after apply)
        name                                 = "openvpn-2024070518392010580000001e"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/openvpn/aws"
            "environment"       = "development"
            "service"           = "openvpn"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpn.module.instance_profile.aws_iam_policy.profile will be updated in-place
  ~ resource "aws_iam_policy" "profile" {
        id               = "arn:aws:iam::493370826424:policy/openvpn-8u1hU4OyuQDT20240705183937201200000024"
        name             = "openvpn-8u1hU4OyuQDT20240705183937201200000024"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "sts:GetCallerIdentity"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "ec2:DescribeInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action    = "ec2:ModifyInstanceAttribute"
                      - Condition = {
                          - StringEquals = {
                              - "ec2:ResourceTag/aws:autoscaling:groupName" = "openvpn-2024070518392010580000001e-nRBgZQ"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "created_by_module" = "infrahouse/instance-profile/aws"
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "16" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-071c75432cc2b93b8" -> "ami-0c91eccbf5507ede1"
      ~ latest_version                       = 16 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 13 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiAxMywgImRlc3Ryb3kiOiAwfX0=
```
</details>